"""Используя Robot Framework, написать автотесты для следующих сценариев:

1.	Локализация хедера.
1.1.	Открыть сайт https://www.epam.com/
1.2.	Убедиться, что выбран английский язык
1.3.	Проверить, что все 6 ссылок в шапке правильно переведены: Services - How We Do It - Our Work – Insights – About – Careers

2.	Работоспособность нажатия на About.
2.1.	Открыть сайт https://www.epam.com/
2.2.	Нажать на About в шапке
2.3.	Проверить, что открылась страница https://www.epam.com/about

3.	Поиск количества упоминаний слова Python
3.1.	Открыть сайт https://www.epam.com/
3.2.	Нажать на кнопку поиск
3.3.	В открывшемся окне ввести значение “Python” и нажать “Find”
3.4.	Проверить, что найденное количество результатов равно 10 (фактическое значение будет другим, поэтому ожидается, что тест должен падать)

Примечания:
•	используйте браузер Chrome
•	используйте отдельный файл для хранения констант
•	не забывайте о логировании и HTML репорте
"""